import { defineConfig } from 'vitepress'

// https://vitepress.dev/reference/site-config
export default defineConfig({
  base: '/', //网站部署的路径，默认根目录
  // base: '/raiden-collection/', //网站部署到github的vitepress这个仓库里
  head: [["link", { rel: "icon", href: '/images/logo.png' }]],
  lang: 'zh-CN',
  title: "雷电将军文本收录",
  description: "Text Collection",
  appearance: 'dark',
  themeConfig: {
    darkModeSwitchLabel: '深浅模式',
    returnToTopLabel: '返回顶部',
    docFooter: {
      prev: '上一页',
      next: '下一页',
    },
    outline: {
      level: [2, 4], // 显示2-4级标题
      label: '当前页大纲' // 文字显示
    },
    //左上角logo
    logo: "/images/logo.png",
    //顶部导航
    nav: [
      // {
      //   text: '其他',
      //   items: [
      //     { text: '主体', link: '/01 角色资料/1.1 角色-资料页.md' },
      //     { text: '通用', link: '/01 角色资料/1.1 角色-资料页.md' },
      //     { text: '方法', link: '/01 角色资料/1.1 角色-资料页.md' },
      //     { text: '扩展', link: '/01 角色资料/1.1 角色-资料页.md' }
      //   ]
      // },
      { text: '前言', link: '/00 介绍/前言.md' }
      // { text: '资源', link: '/01 角色资料/1.1 角色-资料页.md' },
    ],
    sidebarMenuLabel: '目录',
    sidebar: [
      {
        text: '介绍',
        collapsible: true, // 启用折叠功能
        collapsed: true, // 默认展开（可以设置为 true，默认折叠）
        items: [
          { text: '前言', link: '/00 介绍/前言.md' }
        ],
      },
      {
        text: '一、角色资料',
        collapsible: true, // 启用折叠功能
        collapsed: true, // 默认展开（可以设置为 true，默认折叠）
        items: [
          { text: '1.1 角色-资料页', link: '/01 角色资料/1.1 角色-资料页.md' },
          { text: '1.2 故事', link: '/01 角色资料/1.2 角色故事.md' },
          { text: '1.3 语音', link: '/01 角色资料/1.3 语音.md' },
          { text: '1.4 装扮-衣装', link: '/01 角色资料/1.4 装扮-衣装.md' },
          { text: '1.5 名片', link: '/01 角色资料/1.5 名片.md' },
          { text: '1.6 特色料理', link: '/01 角色资料/1.6 特色料理.md' },
          { text: '1.7 活动祈愿名', link: '/01 角色资料/1.7 活动祈愿名.md' },
          { text: '1.8 命之座-天赋', link: '/01 角色资料/1.8 命之座-天赋.md' },
          { text: '1.9 角色登场立绘介绍', link: '/01 角色资料/1.9 角色登场立绘介绍.md' },
          { text: '1.10 生日', link: '/01 角色资料/1.10 生日.md' },
          { text: '1.11 活动-角色介绍', link: '/01 角色资料/1.11 活动-角色介绍.md' },
          { text: '1.12 角色PV', link: '/01 角色资料/1.12 角色PV.md' },
          { text: '1.13 角色演示', link: '/01 角色资料/1.13 角色演示.md' },
          { text: '1.14 拾枝杂谈', link: '/01 角色资料/1.14 拾枝杂谈.md' },
          { text: '1.15 官方EP', link: '/01 角色资料/1.15 官方EP.md' },
          { text: '1.16 邮件', link: '/01 角色资料/1.16 邮件.md' },
          { text: '1.17 复刻小记', link: '/01 角色资料/1.17 复刻小记.md' }
        ], 
      },
      {
        text: '二、其他角色个人资料',
        collapsible: true, // 启用折叠功能
        collapsed: true, // 默认展开（可以设置为 true，默认折叠）
        items: [
          { text: '2.1 九条裟罗', link: '/02 角色个人资料中相关内容/2.1 九条裟罗.md' },
          { text: '2.2 流浪者', link: '/02 角色个人资料中相关内容/2.2 流浪者.md' },
          { text: '2.3 早柚', link: '/02 角色个人资料中相关内容/2.3 早柚.md' },
          { text: '2.4 八重神子', link: '/02 角色个人资料中相关内容/2.4 八重神子.md' },
          { text: '2.5 钟离', link: '/02 角色个人资料中相关内容/2.5 钟离.md' },
          { text: '2.6 温迪', link: '/02 角色个人资料中相关内容/2.6 温迪.md' },
          { text: '2.7 枫原万叶', link: '/02 角色个人资料中相关内容/2.7 枫原万叶.md' },
          { text: '2.8 神里绫华', link: '/02 角色个人资料中相关内容/2.8 神里绫华.md' },
          { text: '2.9 宵宫', link: '/02 角色个人资料中相关内容/2.9 宵宫.md' },
          { text: '2.10 珊瑚宫心海', link: '/02 角色个人资料中相关内容/2.10 珊瑚宫心海.md' },
          { text: '2.11 托马', link: '/02 角色个人资料中相关内容/2.11 托马.md' },
          { text: '2.12 五郎', link: '/02 角色个人资料中相关内容/2.12 五郎.md' },
          { text: '2.13 荒泷一斗', link: '/02 角色个人资料中相关内容/2.13 荒泷一斗.md' },
          { text: '2.14 神里绫人', link: '/02 角色个人资料中相关内容/2.14 神里绫人.md' },
          { text: '2.15 久岐忍', link: '/02 角色个人资料中相关内容/2.15 久岐忍.md' },
          { text: '2.16 纳西妲', link: '/02 角色个人资料中相关内容/2.16 纳西妲.md' },
          { text: '2.17 绮良良', link: '/02 角色个人资料中相关内容/2.17 绮良良.md' },
          { text: '2.18 千织', link: '/02 角色个人资料中相关内容/2.18 千织.md' },
          { text: '2.19 旅行者(空_荧)', link: '/02 角色个人资料中相关内容/2.19 旅行者（空_荧）.md' },
          { text: '2.20 玛薇卡', link: '/02 角色个人资料中相关内容/2.20 玛薇卡.md' },
          { text: '2.21 茜特菈莉', link: '/02 角色个人资料中相关内容/2.21 茜特菈莉.md' },
          { text: '2.22 梦见月瑞希', link: '/02 角色个人资料中相关内容/2.22 梦见月瑞希.md' },
          { text: '2.23 那维莱特', link: '/02 角色个人资料中相关内容/2.23 那维莱特.md' },
          { text: '2.24 哥伦比娅', link: '/02 角色个人资料中相关内容/2.24 哥伦比娅.md' }
        ],
      },
      {
        text: '三、任务',
        collapsible: true, // 启用折叠功能
        collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
        items: [
          // { text: '3.1 魔神任务', link: '/03 任务相关文本/3.1 魔神任务.md' },
          {
            text: '3.1 魔神任务', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            items: [
              { text: '3.1.1 蒙德 序章 第二幕 为了没有眼泪的明天', link: '/03 任务相关文本/3.1.1 蒙德 序章 第二幕.md' },
              { text: '3.1.2 璃月 第一章 第二幕 辞行久远之躯', link: '/03 任务相关文本/3.1.2 璃月 第一章 第二幕.md' },
              { text: '3.1.3 璃月 第一章 第三幕 迫近的客星', link: '/03 任务相关文本/3.1.3 璃月 第一章 第三幕.md' },
              { text: '3.1.4 稻妻 第二章 序幕 振袖秋风问红叶', link: '/03 任务相关文本/3.1.4 稻妻 第二章 序幕.md' },
              { text: '3.1.5 稻妻 第二章 第一幕 不动鸣神，恒常乐土', link: '/03 任务相关文本/3.1.5 稻妻 第二章 第一幕.md' },
              { text: '3.1.6 稻妻 第二章 第二幕 无念无想，泡影断灭', link: '/03 任务相关文本/3.1.6 稻妻 第二章 第二幕.md' },
              { text: '3.1.7 稻妻 第二章 第三幕 千手百眼，天下人间', link: '/03 任务相关文本/3.1.7 稻妻 第二章 第三幕.md' },
              { text: '3.1.8 须弥 第三章 第三幕 迷梦与空幻与欺骗', link: '/03 任务相关文本/3.1.8 须弥 第三章 第三幕.md' },
              { text: '3.1.9 须弥 第三章 第四幕 赤土之王与三朝圣者', link: '/03 任务相关文本/3.1.9 须弥 第三章 第四幕.md' },
              { text: '3.1.10 须弥 第三章 第五幕 虚空鼓动，劫火高扬', link: '/03 任务相关文本/3.1.10 须弥 第三章 第五幕.md' },
              { text: '3.1.11 间章 第三幕 倾落伽蓝', link: '/03 任务相关文本/3.1.11 间章 第三幕.md' },
              { text: '3.1.12 挪德卡莱 空月之歌 第五幕 终北的夜行诗', link: '/03 任务相关文本/3.1.12 挪德卡莱 空月之歌 第五幕.md' },
              { text: '3.1.13 挪德卡莱 空月之歌 第七幕 如果在冬夜，一个旅人', link: '/03 任务相关文本/3.1.13 挪德卡莱 空月之歌 第七幕.md' },
              { text: '3.1.14 挪德卡莱 空月之歌 第八幕 真实之月', link: '/03 任务相关文本/3.1.14 挪德卡莱 空月之歌 第八幕.md' }
            ]
          },
          {
            text: '3.2 传说任务', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            items: [
              { text: '3.2.1 雷电将军传说任务 -- 天下人之章·第一幕「影照浮世风流」', link: '/03 任务相关文本/3.2.1 雷电将军传说任务 天下人之章·第一幕.md' },
              { text: '3.2.2 雷电将军传说任务 -- 天下人之章·第二幕「须臾百梦」', link: '/03 任务相关文本/3.2.2 雷电将军传说任务 天下人之章·第二幕.md' },
              { text: '3.2.3 八重神子传说任务 -- 仙狐之章·第一幕 「鸣神御祓祈愿祭」', link: '/03 任务相关文本/3.2.3 八重神子传说任务 仙狐之章·第一幕.md' },
              { text: '3.2.4 珊瑚宫心海传说任务 -- 眠龙之章·第一幕「兵戈梦去，春草如茵」', link: '/03 任务相关文本/3.2.4 珊瑚宫心海传说任务 眠龙之章·第一幕.md' },
              { text: '3.2.5 荒泷一斗传说任务 -- 天牛之章·第一幕 「赤金魂」', link: '/03 任务相关文本/3.2.5 荒泷一斗传说任务 天牛之章·第一幕.md' },
              { text: '3.2.6 宵宫传说任务 -- 琉金之章·第一幕「如梦如电的隽永」', link: '/03 任务相关文本/3.2.6 宵宫传说任务 琉金之章·第一幕.md' },
              { text: '3.2.7 宵宫传说任务 -- 琉金之章·第二幕「拾星之旅」', link: '/03 任务相关文本/3.2.7 宵宫传说任务 琉金之章·第二幕.md' },
              { text: '3.2.8 神里绫华传说任务 -- 雪鹤之章·第一幕「鹤与白兔的诉说」', link: '/03 任务相关文本/3.2.8 神里绫华传说任务 雪鹤之章·第一幕.md' },
              { text: '3.2.9 神里绫人传说任务 -- 神守柏之章·第一幕「梧桐一叶落」', link: '/03 任务相关文本/3.2.9 神里绫人传说任务 神守柏之章·第一幕.md' },
              { text: '3.2.10 枫原万叶传说任务 -- 枫红之章·第一幕「陌野不识故人」', link: '/03 任务相关文本/3.2.10 枫原万叶传说任务 枫红之章·第一幕.md' },
              { text: '3.2.11 茜特菈莉传说任务 -- 流淌着色彩的回忆·第三幕「七彩之战的真相」', link: '/03 任务相关文本/3.2.11 茜特菈莉传说任务.md' },
              { text: '3.2.12 梦见月瑞希传说任务 -- 貘枕之章·第一幕「食梦者的忧郁」', link: '/03 任务相关文本/3.2.12 梦见月瑞希传说任务.md' }

            ]
          },
          {
            text: '3.3 邀约任务', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            items: [
              { text: '3.3.1 邀约事件·托马 第一幕 家政官的日常工作', link: '/03 任务相关文本/3.3.1 邀约事件·托马 第一幕.md' },
              { text: '3.3.2 邀约事件·久岐忍 第一幕 帮派的日常事务', link: '/03 任务相关文本/3.3.2 邀约事件·久岐忍 第一幕.md' },
              { text: '3.3.3 邀约事件·鹿野院平藏 第一幕 风暴捕物帐', link: '/03 任务相关文本/3.3.3 邀约事件·鹿野院平藏 第一幕.md' }
            ]
          },
          {
            text: '3.4 活动任务', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            items: [
              { text: '3.4.1 「回声轻叙」', link: '/03 任务相关文本/3.4.1 回声轻叙.md' },
              { text: '3.4.2 「幻影心流」', link: '/03 任务相关文本/3.4.2 幻影心流.md' },
              { text: '3.4.3 「谒索雷痕」', link: '/03 任务相关文本/3.4.3 谒索雷痕.md' },
              { text: '3.4.4 「秘宝迷踪」', link: '/03 任务相关文本/3.4.4 秘宝迷踪.md' },
              { text: '3.4.5 「机关棋谭·灵妙之局」', link: '/03 任务相关文本/3.4.5 机关棋谭·灵妙之局.md' },
              { text: '3.4.6 「百人一揆·最强武斗大会」', link: '/03 任务相关文本/3.4.6 百人一揆 最强武斗大会.md' },
              { text: '3.4.7 「谜境悬兵」', link: '/03 任务相关文本/3.4.7 谜境悬兵.md' },
              { text: '3.4.8 「镜花听世」', link: '/03 任务相关文本/3.4.8 镜花听世.md' },
              { text: '3.4.9 「梦里生花」', link: '/03 任务相关文本/3.4.9 梦里生花.md' },
              { text: '3.4.10 「万端珊瑚事件簿·犬武者」', link: '/03 任务相关文本/3.4.10 万端珊瑚事件簿·犬武者.md' },
              { text: '3.4.11 「山海八所巡礼」', link: '/03 任务相关文本/3.4.11 山海八所巡礼.md' },
              { text: '3.4.12 「百人一揆·黄金旋风」', link: '/03 任务相关文本/3.4.12 百人一揆·黄金旋风.md' },
              { text: '3.4.13 「堇庭华彩真说」', link: '/03 任务相关文本/3.4.13 堇庭华彩.md' },
              { text: '3.4.14 「画外旅照」', link: '/03 任务相关文本/3.4.14 画外旅照.md' },
              { text: '3.4.15 「有香自西来」', link: '/03 任务相关文本/3.4.15 有香自西来.md' },
              { text: '3.4.16 「荒泷极上盛世豪鼓大祭典」', link: '/03 任务相关文本/3.4.16 荒泷极上盛世豪鼓大祭典.md' },
              { text: '3.4.17 「远海诗夏游纪」', link: '/03 任务相关文本/3.4.17 远海诗夏游纪.md' },
              { text: '3.4.18 「百人一揆·鸣神擂台」', link: '/03 任务相关文本/3.4.18 百人一揆·鸣神擂台.md' },
              { text: '3.4.19 「智巧灵蕈大竞逐」', link: '/03 任务相关文本/3.4.19 智巧灵蕈大竞逐.md' },
              { text: '3.4.20 「秋津森夜试胆会」', link: '/03 任务相关文本/3.4.20 秋津森夜试胆会.md' },
              { text: '3.4.21 「演武传心」', link: '/03 任务相关文本/3.4.21 演武传心.md' },
              { text: '3.4.22 「灵蕈棋阵」', link: '/03 任务相关文本/3.4.22 灵蕈棋阵.md' },
              { text: '3.4.23 「决斗！召唤之巅！」', link: '/03 任务相关文本/3.4.23 决斗！召唤之巅！.md' },
              { text: '3.4.24 「清夏！乐园？大秘境！」', link: '/03 任务相关文本/3.4.24 清夏乐园大秘境.md' },
              { text: '3.4.25 「荒泷生命摇滚虹色大巡回」', link: '/03 任务相关文本/3.4.25 荒泷生命摇滚虹色大巡回.md' },
              { text: '3.4.26 「绮绘的踪绪」', link: '/03 任务相关文本/3.4.26 绮绘的踪绪.md' },
              { text: '3.4.27 「提瓦特忆画」', link: '/03 任务相关文本/3.4.27 提瓦特忆画.md' },
              { text: '3.4.28 「三川游艺绮梦谭」', link: '/03 任务相关文本/3.4.28 三川游艺绮梦谭.md' },
              { text: '3.4.29 「炽魂斗士的雪界之旅」', link: '/03 任务相关文本/3.4.29 炽魂斗士的雪界之旅.md' },
              { text: '3.4.30 「瞬影旅集」', link: '/03 任务相关文本/3.4.30 瞬影旅集.md' }
            ]
          },
          {
            text: '3.5 世界任务', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            items: [
              { text: '3.5.1 神樱大祓', link: '/03 任务相关文本/3.5.1 神樱大祓.md' },
              { text: '3.5.2 广海的守望', link: '/03 任务相关文本/3.5.2 广海的守望.md' },
              { text: '3.5.3 在他乡', link: '/03 任务相关文本/3.5.3 在他乡.md' },
              { text: '3.5.4 《第七个武士》', link: '/03 任务相关文本/3.5.4 第七个武士.md' },
              { text: '3.5.5 手鞠游戏', link: '/03 任务相关文本/3.5.5 手鞠游戏.md' },
              { text: '3.5.6 农民的宝藏', link: '/03 任务相关文本/3.5.6 农民的宝藏.md' },
              { text: '3.5.7 特别的御神签', link: '/03 任务相关文本/3.5.7 特别的御神签.md' },
              { text: '3.5.8 神明啊，我做得对吗？', link: '/03 任务相关文本/3.5.8 神明啊，我做得对吗.md' },
              { text: '3.5.9 「八重堂」的邀约', link: '/03 任务相关文本/3.5.9 八重堂的邀约.md' },
              { text: '3.5.10 踏鞴物语', link: '/03 任务相关文本/3.5.10 踏鞴物语.md' },
              { text: '3.5.11 医樱', link: '/03 任务相关文本/3.5.11 医樱.md' },
              { text: '3.5.12 刀剑成梦', link: '/03 任务相关文本/3.5.12 刀剑成梦.md' },
              { text: '3.5.13 远吕羽遗事', link: '/03 任务相关文本/3.5.13 远吕羽遗事.md' },
              { text: '3.5.14 孤岛诊疗谭', link: '/03 任务相关文本/3.5.14 孤岛诊疗谭.md' },
              { text: '3.5.15 执望三千里', link: '/03 任务相关文本/3.5.15 执望三千里.md' },
              { text: '3.5.16 险恶的教喻', link: '/03 任务相关文本/3.5.16 险恶的教喻.md' },
              { text: '3.5.17 武者的宿命', link: '/03 任务相关文本/3.5.17 武者的宿命.md' },
              { text: '3.5.18 月浴之渊', link: '/03 任务相关文本/3.5.18 月浴之渊.md' },
              { text: '3.5.19 海渊仙草灵验记', link: '/03 任务相关文本/3.5.19 海渊仙草灵验记.md' },
              { text: '3.5.20 孤独的海兽', link: '/03 任务相关文本/3.5.20 孤独的海兽.md' },
              { text: '3.5.21 门户清理', link: '/03 任务相关文本/3.5.21 门户清理.md' },
              { text: '3.5.22 清籁逐雷记', link: '/03 任务相关文本/3.5.22 清籁逐雷记.md' },
              { text: '3.5.23 清籁旧忆', link: '/03 任务相关文本/3.5.23 清籁旧忆.md' },
              { text: '3.5.24 寝子是只猫', link: '/03 任务相关文本/3.5.24 寝子是只猫.md' },
              { text: '3.5.25 鸣神寻踪', link: '/03 任务相关文本/3.5.25 鸣神寻踪.md' },
              { text: '3.5.26 雾海纪行', link: '/03 任务相关文本/3.5.26 雾海纪行.md' },
              { text: '3.5.27 健忘大王历险记', link: '/03 任务相关文本/3.5.27 健忘大王历险记.md' },
              { text: '3.5.28 白夜国晨昏记', link: '/03 任务相关文本/3.5.28 白夜国晨昏记.md' },
              { text: '3.5.29 厄瑞玻斯的秘密', link: '/03 任务相关文本/3.5.29 厄瑞玻斯的秘密.md' },
              { text: '3.5.30 全能美食队', link: '/03 任务相关文本/3.5.30 全能美食队.md' },
              { text: '3.5.31 永无止境的研究', link: '/03 任务相关文本/3.5.31 永无止境的研究.md' },
              { text: '3.5.32 森林书', link: '/03 任务相关文本/3.5.32 森林书.md' },
              { text: '3.5.33 岩藏武艺帐', link: '/03 任务相关文本/3.5.33 岩藏武艺帐.md' },
              { text: '3.5.34 咔嚓！', link: '/03 任务相关文本/3.5.34 咔嚓.md' },
              { text: '3.5.35 异乡人，请回答', link: '/03 任务相关文本/3.5.35 异乡人请回答.md' },
              { text: '3.5.36 芬芳的憧憬', link: '/03 任务相关文本/3.5.36 芬芳的憧憬.md' },
            ]
          },
          {
            text: '3.6 委托任务', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            items: [
              { text: '3.6.1 家乡之味', link: '/03 任务相关文本/3.6.1 家乡之味.md' },
              { text: '3.6.2 这本小说…厉害吗？', link: '/03 任务相关文本/3.6.2 这本小说厉害吗.md' },
              { text: '3.6.3 众人祈祷中…', link: '/03 任务相关文本/3.6.3 众人祈祷中.md' },
              { text: '3.6.4 万端珊瑚事件簿', link: '/03 任务相关文本/3.6.4 万端珊瑚事件簿.md' },
              { text: '3.6.5 万端珊瑚事件簿·合适的身份', link: '/03 任务相关文本/3.6.5 万端珊瑚事件簿·合适的身份.md' },
              { text: '3.6.6 万端珊瑚事件簿·结案时刻', link: '/03 任务相关文本/3.6.6 万端珊瑚事件簿·结案时刻.md' },
              { text: '3.6.7 万端珊瑚事件簿·收尾工作', link: '/03 任务相关文本/3.6.7 万端珊瑚事件簿·收尾工作.md' },
              { text: '3.6.8 全能美食队·烹饪对决', link: '/03 任务相关文本/3.6.8 全能美食队·烹饪对决.md' },
              { text: '3.6.9 神明啊，回应我吧！', link: '/03 任务相关文本/3.6.9 神明啊回应我吧.md' },
              { text: '3.6.10 神龛啊，再次显灵吧！', link: '/03 任务相关文本/3.6.10 神龛啊再次显灵吧.md' },
              { text: '3.6.11 必须精进的武艺', link: '/03 任务相关文本/3.6.11 必须精进的武艺.md' },
              { text: '3.6.12 全能美食队·厨道的极意', link: '/03 任务相关文本/3.6.12 全能美食队·厨道的极意.md' },
              { text: '3.6.13 永不停歇的修炼', link: '/03 任务相关文本/3.6.13 永不停歇的修炼.md' },
              { text: '3.6.14 万端珊瑚事件簿·搜索工作', link: '/03 任务相关文本/3.6.14 万端珊瑚事件簿·搜索工作.md' },
              { text: '3.6.15 稻妻时尚入门', link: '/03 任务相关文本/3.6.15 稻妻时尚入门.md' },
              { text: '3.6.16 神社大扫除', link: '/03 任务相关文本/3.6.16 神社大扫除.md' },
              { text: '3.6.17 生存的方式', link: '/03 任务相关文本/3.6.17 生存的方式.md' },
              { text: '3.6.18 一千零一杯咖啡', link: '/03 任务相关文本/3.6.18 一千零一杯咖啡.md' },
              { text: '3.6.19 御用在他乡', link: '/03 任务相关文本/3.6.19 御用在他乡.md' },
            ]
          },
          { text: '3.7 声望·稻妻', link: '/03 任务相关文本/3.7 声望·稻妻.md' },
        ],
      },
      {
        text: '四、BOSS',
        collapsible: true, // 启用折叠功能
        collapsed: true, // 默认展开（可以设置为 true，默认折叠）
        items: [
          { text: '4.1 雷电将军 「尘世七执政·雷之神」', link: '/04 boss相关文本/4.1 雷电将军.md' },
          { text: '4.2 影 「一心净土的主人」', link: '/04 boss相关文本/4.2 影.md' },
          { text: '4.3 祸津御建鸣神命 「雷电之稻妻殿」', link: '/04 boss相关文本/4.3 祸津御建鸣神命.md' },
          { text: '4.3 「正机之神」 七叶寂照秘密主', link: '/04 boss相关文本/4.4 正机之神.md' },

        ],
      },
      {
        text: '五、地图',
        collapsible: true, // 启用折叠功能
        collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
        items: [
          {
            text: '5.1 大世界交互内容', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            items: [
              { text: '5.1.1 npc对话', link: '/05 地图相关文本/5.1.1 npc对话.md' },
              { text: '5.1.2 留言板', link: '/05 地图相关文本/5.1.2 留言板.md' },
              { text: '5.1.3 地狐', link: '/05 地图相关文本/5.1.3 地狐.md' },
              { text: '5.1.4 地图文本', link: '/05 地图相关文本/5.1.4 地图文本.md' },
              { text: '5.1.5 神樱眷顾·雷种子', link: '/05 地图相关文本/5.1.5 神樱眷顾.md' },
            ]
          },
          {
            text: '5.2 图鉴-生物志', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            link: '/05 地图相关文本/5.2 图鉴-生物志.md'
          },
          {
            text: '5.3 秘境', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            link: '/05 地图相关文本/5.3 秘境.md'
          },
          {
            text: '5.4 地图建筑物', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            link: '/05 地图相关文本/5.4 地图建筑物.md'
          },
          {
            text: '5.5 加载提示', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            link: '/05 地图相关文本/5.5 加载提示.md'
          },
          {
            text: '5.6 地理志', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            link: '/05 地图相关文本/5.6 地理志.md'
          },
          {
            text: '5.7 教程', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            link: '/05 地图相关文本/5.7 教程.md'
          },
          {
            text: '5.8 探索派遣地区', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            link: '/05 地图相关文本/5.8 探索派遣地区.md'
          },
          {
            text: '5.9 冒险之证-讨伐', // 子分组标题
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认false展开（可以设置为 true，默认折叠）
            link: '/05 地图相关文本/5.9 冒险之证-讨伐.md'
          },
            ]
          },
          {
            text: '六、成就',
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认展开（可以设置为 true，默认折叠）
            items: [
              { text: '6.1 成就', link: '/06 成就/6.1 成就.md' },
            ],
          },
          {
            text: '七、背包物品',
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认展开（可以设置为 true，默认折叠）
            items: [
              { text: '7.1 武器', link: '/07 背包物品/7.1 武器.md' },
              { text: '7.2 圣遗物', link: '/07 背包物品/7.2 圣遗物.md' },
              { text: '7.3 材料', link: '/07 背包物品/7.3 材料.md' },
              { text: '7.4 冒险道具', link: '/07 背包物品/7.4 冒险道具.md' },
              { text: '7.5 小道具', link: '/07 背包物品/7.5 小道具.md' },
              { text: '7.6 七国徽印', link: '/07 背包物品/7.6 七国徽印.md' },
              { text: '7.7 风之翼', link: '/07 背包物品/7.7 风之翼.md' },
              { text: '7.8 食物', link: '/07 背包物品/7.8 食物.md' },
              { text: '7.9 任务道具', link: '/07 背包物品/7.9 任务道具.md' },
              { text: '7.10 名片', link: '/07 背包物品/7.10 名片.md' }
            ],
          },
          {
            text: '八、尘歌壶',
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认展开（可以设置为 true，默认折叠）
            items: [
              { text: '8.1 摆设', link: '/08 尘歌壶/8.1 摆设.md' },
              { text: '8.2 摆设套装及对话', link: '/08 尘歌壶/8.2 摆设套装及对话.md' },
              { text: '8.3 尘歌壶对话', link: '/08 尘歌壶/8.3 尘歌壶对话.md' }
            ],
          },
          {
            text: '九、幻想真境剧诗',
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认展开（可以设置为 true，默认折叠）
            items: [
              { text: '9.1 幻想真境剧诗相关内容', link: '/09 幻想真境剧诗/9.1 幻想真境剧诗相关内容.md' }
            ],
          },
          {
            text: '十、七圣召唤',
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认展开（可以设置为 true，默认折叠）
            items: [
              { text: '10.1 角色邀请对话', link: '/10 七圣召唤/10.1 角色邀请对话.md' },
              { text: '10.2 角色牌', link: '/10 七圣召唤/10.2 角色牌.md' },
              { text: '10.3 行动牌', link: '/10 七圣召唤/10.3 行动牌.md' },
              { text: '10.4 魔物牌', link: '/10 七圣召唤/10.4 魔物牌.md' },
              { text: '10.5 牌盒及牌背', link: '/10 七圣召唤/10.5 牌盒及牌背.md' },
              { text: '10.6 七圣召唤关卡', link: '/10 七圣召唤/10.6 七圣召唤关卡.md' }
            ],
          },
          {
            text: '十一、游逸旅闻',
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认展开（可以设置为 true，默认折叠）
            items: [
              { text: '11.1 游逸旅闻·相缘绘愿', link: '/11 游逸旅闻/11.1 游逸旅闻·相缘绘愿.md' },
              { text: '11.2 逸闻纪事', link: '/11 游逸旅闻/11.2 逸闻纪事.md' }
            ],
          },
          {
            text: '十二、游戏外相关内容',
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认展开（可以设置为 true，默认折叠）
            items: [
              { text: '12.1 B站-原神官方视频', link: '/12 游戏外相关内容/12.1 B站-官方视频.md' },
              { text: '12.2 B站-派蒙的工作笔记视频', link: '/12 游戏外相关内容/12.2 B站-派蒙的工作笔记视频.md' },
              { text: '12.3 YouTube-原神官方视频', link: '/12 游戏外相关内容/12.3 YouTube-原神官方视频.md' },
              { text: '12.4 抖音官方视频', link: '/12 游戏外相关内容/12.4 TikTok官方视频.md' },
              { text: '12.5 过场动画', link: '/12 游戏外相关内容/12.5 过场动画.md' },
              { text: '12.6 动态', link: '/12 游戏外相关内容/12.6 动态.md' },
              { text: '12.7 推特动态', link: '/12 游戏外相关内容/12.7 推特动态.md' },
              { text: '12.8 网页活动', link: '/12 游戏外相关内容/12.8 网页活动.md' },
              { text: '12.9 提瓦特美食札记', link: '/12 游戏外相关内容/12.9 提瓦特美食札记.md' },
              { text: '12.10 原神官网相关', link: '/12 游戏外相关内容/12.10 原神官网相关.md' },
              { text: '12.11 前瞻收录', link: '/12 游戏外相关内容/12.11 前瞻收录.md' },
              { text: '12.12 杂志', link: '/12 游戏外相关内容/12.12 杂志.md' },
              { text: '12.13 PlayStationBlog', link: '/12 游戏外相关内容/12.13 PlayStationBlog.md' }
            ],
          },
          {
            text: '十三、资源汇总',
            collapsible: true, // 启用折叠功能
            collapsed: true, // 默认展开（可以设置为 true，默认折叠）
            items: [
              { text: '13.1 资源汇总', link: '/13 资源汇总/13.1 资源汇总.md' }
            ],
          } 
    ],
    socialLinks: [
      { icon: 'github', link: 'https://github.com/jinlijinlijinli' },
      {
        icon: {
          svg: '<svg t="1712563369533" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5180" width="128" height="128"><path d="M777.514667 131.669333a53.333333 53.333333 0 0 1 0 75.434667L728.746667 255.829333h49.92A160 160 0 0 1 938.666667 415.872v320a160 160 0 0 1-160 160H245.333333A160 160 0 0 1 85.333333 735.872v-320a160 160 0 0 1 160-160h49.749334L246.4 207.146667a53.333333 53.333333 0 1 1 75.392-75.434667l113.152 113.152c3.370667 3.370667 6.186667 7.04 8.448 10.965333h137.088c2.261333-3.925333 5.12-7.68 8.490667-11.008l113.109333-113.152a53.333333 53.333333 0 0 1 75.434667 0z m1.152 231.253334H245.333333a53.333333 53.333333 0 0 0-53.205333 49.365333l-0.128 4.010667v320c0 28.117333 21.76 51.157333 49.365333 53.162666l3.968 0.170667h533.333334a53.333333 53.333333 0 0 0 53.205333-49.365333l0.128-3.968v-320c0-29.44-23.893333-53.333333-53.333333-53.333334z m-426.666667 106.666666c29.44 0 53.333333 23.893333 53.333333 53.333334v53.333333a53.333333 53.333333 0 1 1-106.666666 0v-53.333333c0-29.44 23.893333-53.333333 53.333333-53.333334z m320 0c29.44 0 53.333333 23.893333 53.333333 53.333334v53.333333a53.333333 53.333333 0 1 1-106.666666 0v-53.333333c0-29.44 23.893333-53.333333 53.333333-53.333334z" p-id="5181"></path></svg>'
        },
        link: 'https://space.bilibili.com/11165777'
      }
    ],

    // 搜索框样式
    search: {
      provider: "local",
      options: {
        translations: {
          button: {
            buttonText: "搜索文档",
            buttonAriaLabel: "搜索文档",
          },
          modal: {
            noResultsText: "无法找到相关结果",
            resetButtonTitle: "清除查询条件",
            footer: {
              selectText: "选择",
              navigateText: "切换",
            },
          },
        },
      },
    },
    markdown: {
      container: {
        tipLabel: '提示',
        warningLabel: '警告',
        dangerLabel: '危险',
        infoLabel: '信息',
        detailsLabel: '详细信息'
      },
      image: {
        // 开启图片懒加载
        lazyLoading: true
      }
    },

    footer: {
      copyright: "© 2025 Jinli. | 原神文本衍生整理作品 | 版权米哈游所有"
    }
  }
})
